//
// Created by Garven on 2018/7/14.
//
#include <stdio.h>

// === 数组: 是一个变量, 由数据类型相同的一组元素相同 === //
// === 1 与 元素 的差别: 变量是内存中的一块空间, 数组是内存中一串连续地空间 === //
// === 2 标识符: 数组的名称 === //
// === 3 数组元素: 数组中存放的数据 === //
// === 4 元素下标: 元素的编号, 从0开始 === //
// === 5 元素类型: 元素的数据类型 === //
// === 6 数组长度固定不变，避免越界 === //

void main ()
{
    // 0 为 假, 1 为 真, C里没有bool
    printf("5 < 6? %d\n", 5 > 6);
    printf("5 > 6? %d\n", 5 < 6);

    printf("整型所占空间是 %d 字节\n", sizeof(1997));
    printf("单精度所占空间是 %d 字节\n", sizeof(1997.0f));
    printf("双精度所占空间是 %d 字节\n", sizeof(1997.00));

    // 短路运算: false && xxx, xxx不会被执行
    int num = 10;
    int result = num++ > 11 && --num < 20;
    printf("result = %d, %d\n", num, result);

    printf("%d\n", 45 % 3 * 9);
}
