//
// Created by Garven on 2018/7/14.
//
#include <stdio.h>

// === printf函数: 输出函数 === //
// === scanf函数: 输入函数, 可读取不同欧诺个格式的数据, 当读取基本类型的值时, 变量前面要加 & 符号 === //

// === 占位符: === //
// === 1 %d / %i: 有符号十进制整数 === //
// === 2 %c: 单个字符 === //
// === 3 %f: 浮点数, 默认精确到6位小数 === //
// === 4 %%: 百分数 === //
// === 5 %s: 字符串 === //
// === 6 %lf: 双精度浮点数 === //
// === 7 %x: 十六进制 === //
// === 8 %p: 指针 === //

void main ()
{
    int num;
    int ret;
    printf("请输入数量: ");
    scanf("%d", &num);
    ret = num * 100;
    printf("扩大一百倍后: %d", ret);
}
