//
// Created by Garven on 2018/7/14.
//
#include <stdio.h>

#define N 5

// === 指针: 一个值为内存地址的变量(或数据对象) === //
// === 1 语法: 数据类型 * 指针变量名, 如 int * ptr_num; double * p_price; === //
// === 2 注意: 在头文件<stdio.h>中, NULL被定义为常量, int * ptr_num = NULL; 指针的初值设为空, 表示指针不指向任何地址 === //
// === 3 取地址符: & === //
// === 4 简介运算符: * , 如 *ptr_num; 表示 取 ptr_num 所对应的值; *ptr_num = 9999; 表示找到 ptr_num 变量所对应的内存空间, 并将空间中的值修改成 9999 === //
/*
                                        内存
  ____________________________________________________________________________
 |                                                                            |
 |                                                                            |
 |      int year;                           int * prt_year;                   |
 |    ______________                      ___________________                 |
 |   |              |                    |                   |                |
 |   |     2016     |                    |      0028FF44     |                |
 |    --------------                      -------------------                 |
 |      0028FF44                                                              |
 |  (内存地址一般用16进制表示)                                                   |
 |                                                                            |
  ----------------------------------------------------------------------------
        int year;                                   int * ptr_year;
        year = 2016;                                ptr_year = &year;

        在内存中, 为我们分配了一块空间,                 int * ptr_year 为 一指针,
        名字叫 year, 值为 2016,                      ptr_year = &year; 的意思是: 取year变量的地址赋值给 ptr_year,
        每个变量都有一个内存地址, year变量              而 prt_year 变量 指向了 year 变量
        的为 0024FF44
*/

int main ()
{

    int num = 9;
    int * ptr_num = &num;

    printf("指针地址: %p, 十六进制: %x, 值: %d\n", ptr_num, &num, *ptr_num);

    *ptr_num = 9999;

    printf("值: %d\n", *ptr_num);
}
